       IDENTIFICATION DIVISION.
       PROGRAM-ID. ESERCIZIO.

       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT FILE-VENDITE ASSIGN TO "Vendite-mese.trimestre.txt"
           ORGANIZATION IS LINE SEQUENTIAL.

           SELECT FILE-MESE ASSIGN TO "Vendite-mese.dax"
           ORGANIZATION IS LINE SEQUENTIAL.

           SELECT FILE-TRIMESTRE ASSIGN TO "Vendite-trimestre.dax"
           ORGANIZATION IS LINE SEQUENTIAL.

           SELECT FILE-REGIONE ASSIGN TO "Vendite-regione.dax"
           ORGANIZATION IS LINE SEQUENTIAL.

       DATA DIVISION.
       FILE SECTION.
       FD FILE-VENDITE.
       01 VENDITE.
           88 END-OF-FILE VALUE HIGH-VALUES.
           05 REGIONE-NUM PIC 99.
           05 TRIMESTRE PIC 99.
           05 MESE PIC 99.
           05 IMPORTO PIC 9(5).

       FD FILE-MESE.
       01 RECORD-MESE.
           05 RECORD-MESE-NOME PIC X(10).
           05 RECORD-MESE-SOMMA PIC X(10).

        FD FILE-TRIMESTRE.
        01 RECORD-TRIMESTRE.
           05 RECORD-TRIMESTRE-NUMERO PIC X(10).
           05 RECORD-TRIMESTRE-SOMMA PIC X(10).

       FD FILE-REGIONE.
       01 RECORD-REGIONE.
           05 RECORD-REGIONE-NUMERO PIC X(10).
           05 RECORD-REGIONE-SOMMA PIC X(10).
           05 RECORD-REGIONE-TRIMESTRE PIC X(10).

       WORKING-STORAGE SECTION.
       01 INDICE-REGIONE PIC 99.
       01 INDICE-TRIMESTRE PIC 99.
       01 INDICE-MESE PIC 99.
       01 SCELTA PIC 9.
       01 LETTURA-FILE PIC X.
       01 LINEA-REPORT.
           05 FILLER PIC X(50) VALUE ALL "-".

       01 VENDITE-MESE.
           05 MESE-SOMME OCCURS 12 TIMES PIC 9(5) VALUE 0.
       01 MESI-NOME VALUE "GenFebMarAprMagGiuLugAgoSetOttNovDic". 
           05 MESE-GRUPPO OCCURS 12 TIMES.
            10 MESE-ABBREV PIC X(3).

       01 VENDITE-TRIMESTRE.
           05 TRIMESTRE-SOMME OCCURS 4 TIMES PIC 9(5) VALUE 0. 

       01 VENDITE-REGIONE.
           05 REGIONE-NUM-VENDITE OCCURS 4 TIMES.
            10 REGIONE-SOMME-TRIMESTRE OCCURS 4 TIMES
                PIC 9(5) VALUE 0.
      
       01 TABELLA-VENDITE.
           05 TAB-REGIONE-NUM PIC 99.
           05 TAB-TRIMESTRE PIC 99.
           05 TAB-MESE PIC 99.
           05 TAB-IMPORTO PIC 9(5).

       PROCEDURE DIVISION.
       MAIN.
       PERFORM UNTIL SCELTA = 4
        PERFORM GET-DISPLAY
        EVALUATE SCELTA
            WHEN 1
                PERFORM RESET-VENDITE-MESE
                PERFORM GET-VENDITE-MESE
                PERFORM GET-RECORD-MESE
            WHEN 2
                PERFORM RESET-VENDITE-TRIMESTRE
                PERFORM GET-VENDITE-TRIMESTRE
                PERFORM GET-RECORD-TRIMESTRE
            WHEN 3
                PERFORM RESET-VENDITE-REGIONE
                PERFORM GET-VENDITE-REGIONE
                PERFORM GET-RECORD-REGIONE
            WHEN 4
                DISPLAY "Esci dal programma"
            WHEN OTHER
                DISPLAY "Invalid number"
        END-EVALUATE
        END-PERFORM
        GOBACK.

       GET-DISPLAY.
       DISPLAY LINEA-REPORT.
       DISPLAY "Scegli quale report visualizzare: ".
       DISPLAY "1 - Vendite totali per mese".
       DISPLAY "2 - Vendite trimestrali".
       DISPLAY "3 - Vendite regionali per trimestre".
       DISPLAY "4 - Esci".
       DISPLAY LINEA-REPORT.
       ACCEPT SCELTA.

       RESET-VENDITE-MESE.
        OPEN INPUT FILE-VENDITE
        MOVE 'N' TO LETTURA-FILE
       PERFORM UNTIL LETTURA-FILE = 'Y'
        READ FILE-VENDITE INTO TABELLA-VENDITE
            AT END
                MOVE 'Y' TO LETTURA-FILE
            NOT AT END
                MOVE 0 TO MESE-SOMME(TAB-MESE)
        END-READ
        END-PERFORM
       CLOSE FILE-VENDITE.

       GET-VENDITE-MESE.
       OPEN INPUT FILE-VENDITE
       MOVE 'N' TO LETTURA-FILE
       PERFORM UNTIL LETTURA-FILE = 'Y'
        READ FILE-VENDITE INTO TABELLA-VENDITE
            AT END
                MOVE 'Y' TO LETTURA-FILE
            NOT AT END
                ADD TAB-IMPORTO TO MESE-SOMME(TAB-MESE)
        END-READ
       END-PERFORM
       CLOSE FILE-VENDITE.

       GET-RECORD-MESE.
       OPEN OUTPUT FILE-MESE
        PERFORM VARYING INDICE-MESE FROM 1 BY 1 UNTIL INDICE-MESE > 12
            MOVE MESE-GRUPPO(INDICE-MESE) TO RECORD-MESE-NOME
            MOVE MESE-SOMME(INDICE-MESE) TO RECORD-MESE-SOMMA
            WRITE RECORD-MESE
        END-PERFORM
       CLOSE FILE-MESE.

       RESET-VENDITE-TRIMESTRE.
       OPEN INPUT FILE-VENDITE
       MOVE 'N' TO LETTURA-FILE
       PERFORM UNTIL LETTURA-FILE = 'Y'
        READ FILE-VENDITE INTO TABELLA-VENDITE
            AT END
                MOVE 'Y' TO LETTURA-FILE
            NOT AT END
                MOVE 0 TO TRIMESTRE-SOMME(TAB-TRIMESTRE)
        END-READ
       END-PERFORM
       CLOSE FILE-VENDITE.

       GET-VENDITE-TRIMESTRE.
       OPEN INPUT FILE-VENDITE
       MOVE 'N' TO LETTURA-FILE
       PERFORM UNTIL LETTURA-FILE = 'Y'
        READ FILE-VENDITE INTO TABELLA-VENDITE
            AT END
                MOVE 'Y' TO LETTURA-FILE
            NOT AT END
                ADD TAB-IMPORTO TO TRIMESTRE-SOMME(TAB-TRIMESTRE)
        END-READ
       END-PERFORM
       CLOSE FILE-VENDITE.

       GET-RECORD-TRIMESTRE.
       OPEN OUTPUT FILE-TRIMESTRE
        PERFORM VARYING INDICE-TRIMESTRE FROM 1 BY 1 UNTIL INDICE-TRIMESTRE > 4
            MOVE INDICE-TRIMESTRE TO RECORD-TRIMESTRE-NUMERO
            MOVE TRIMESTRE-SOMME(INDICE-TRIMESTRE) TO RECORD-TRIMESTRE-SOMMA
            WRITE RECORD-TRIMESTRE
        END-PERFORM
       CLOSE FILE-TRIMESTRE.

       RESET-VENDITE-REGIONE.
       OPEN INPUT FILE-VENDITE
       MOVE 'N' TO LETTURA-FILE
       PERFORM UNTIL LETTURA-FILE = 'Y'
        READ FILE-VENDITE INTO TABELLA-VENDITE
            AT END
                MOVE 'Y' TO LETTURA-FILE
            NOT AT END
                MOVE 0 TO REGIONE-SOMME-TRIMESTRE(TAB-REGIONE-NUM, TAB-TRIMESTRE)
        END-READ
       END-PERFORM
       CLOSE FILE-VENDITE.

       GET-VENDITE-REGIONE.
       OPEN INPUT FILE-VENDITE
       MOVE 'N' TO LETTURA-FILE
       PERFORM UNTIL LETTURA-FILE = 'Y'
        READ FILE-VENDITE INTO TABELLA-VENDITE
            AT END
                MOVE 'Y' TO LETTURA-FILE
            NOT AT END
                ADD TAB-IMPORTO TO REGIONE-SOMME-TRIMESTRE(TAB-REGIONE-NUM, TAB-TRIMESTRE)
        END-READ
       END-PERFORM
       CLOSE FILE-VENDITE.

       GET-RECORD-REGIONE.
       OPEN OUTPUT FILE-REGIONE
        PERFORM VARYING INDICE-REGIONE FROM 1 BY 1 UNTIL INDICE-REGIONE > 4
            PERFORM VARYING INDICE-TRIMESTRE FROM 1 BY 1 UNTIL INDICE-TRIMESTRE > 4
                MOVE INDICE-REGIONE TO RECORD-REGIONE-NUMERO
                MOVE REGIONE-SOMME-TRIMESTRE(INDICE-REGIONE, INDICE-TRIMESTRE) TO RECORD-REGIONE-SOMMA
                MOVE INDICE-TRIMESTRE TO RECORD-REGIONE-TRIMESTRE
                WRITE RECORD-REGIONE
            END-PERFORM
        END-PERFORM
       CLOSE FILE-REGIONE.
