       IDENTIFICATION DIVISION.
       PROGRAM-ID. PERFORM.
       AUTHOR. NELLO.
       DATE-WRITTEN. 10/06/2024.
       DATA DIVISION.
           WORKING-STORAGE SECTION.
           01 WS-VARIABILE PIC 9(1) VALUE 0.

       PROCEDURE DIVISION.
           PARAGRAFO-A.
           PERFORM PARAGRAFO-B VARYING WS-VARIABILE FROM 1 BY 1 UNTIL WS-VARIABILE = 5.
           STOP RUN.

           PARAGRAFO-B.
           DISPLAY "PARAGRAFO-B VARIABILE:" WS-VARIABILE.
           IF WS-VARIABILE = 3
             MOVE 4 TO WS-VARIABILE
           END-IF.
           
