       IDENTIFICATION DIVISION.
       PROGRAM-ID. PERFORM.
       AUTHOR. NELLO.
       DATE-WRITTEN. 10/06/2024.
       DATA DIVISION.
           WORKING-STORAGE SECTION.
           01 CONTATORE PIC 9(1) VALUE 0.

       PROCEDURE DIVISION.
           PERFORM UNTIL CONTATORE >=5
           ADD 1 TO CONTATORE
           DISPLAY "NUMERO CVONTATORE: "CONTATORE
           END-PERFORM
           GOBACK.

           PERFORM WITH TEST AFTER UNTIL CONTATORE = 0
           SUBTRACT 1 FROM CONTATORE
           DISPLAY "NUMERO ALL'INDIETRO CONTATORE: "CONTATORE
           END-PERFORM
           GOBACK.
           
