       IDENTIFICATION DIVISION.
       PROGRAM-ID. CONVERTITORE-C-F.
       AUTHOR. ROBERTO.
       DATE-WRITTEN. 12/06/2024.
 
       DATA DIVISION.
           WORKING-STORAGE SECTION.
           01 TABELLA. 
               05 CONTENUTO PIC A(10) VALUE "TEST" OCCURS 5 TIMES.


       PROCEDURE DIVISION.
           MAIN.
               DISPLAY "TABELLA A DIMENSIONE UNO:" TABELLA.
           STOP RUN.
      