       IDENTIFICATION DIVISION.
       PROGRAM-ID. HELLOWORLD.
       AUTHOR. NELLO.
       DATE-WRITTEN. 10/06/2024.
       DATA DIVISION.
           WORKING-STORAGE SECTION.
           01 TEMP_SERRA PIC 9(6) VALUE 0.

       PROCEDURE DIVISION.
           DISPLAY "INSERISCI LA TEMPERATURA DELLA SERRA: ".
           ACCEPT TEMP_SERRA.
           IF TEMP_SERRA < 5 THEN
             DISPLAY "STATO DELLA SERRA: DANNI IRREPARABILI"
           ELSE IF TEMP_SERRA < 18 THEN
             DISPLAY "STATO DELLA SERRA: SITUAZIONE DI PERICOLO"
           ELSE
             DISPLAY "STATO DELLA SERRA: NORMALE"
           END-IF
       STOP RUN.