       IDENTIFICATION DIVISION.
       PROGRAM-ID. HELLOWORLD.
       AUTHOR. NELLO.
       DATE-WRITTEN. 10/06/2024.
       DATA DIVISION.
           WORKING-STORAGE SECTION.
           01 TEMP_SERRA PIC 9(6) VALUE 0.

       PROCEDURE DIVISION.
           DISPLAY "INSERISCI LA TEMPERATURA DELLA SERRA: ".
           ACCEPT TEMP_SERRA.
           EVALUATE TRUE
             WHEN TEMP_SERRA < 5
               DISPLAY "STATO DELLA SERRA: DANNI IRREPARABILI"
             WHEN TEMP_SERRA < 18
               DISPLAY "STATO DELLA SERRA: SITUAZIONE DI PERICOLO"
             WHEN OTHER
               DISPLAY "STATO DELLA SERRA: NORMALE"
           END-EVALUATE
       STOP RUN.