       IDENTIFICATION DIVISION.
       PROGRAM-ID. HELLOWORLD.
       AUTHOR. NELLO.
       DATE-WRITTEN. 10/06/2024.
       DATA DIVISION.
           WORKING-STORAGE SECTION.
  
           01  TEMPERATURE-IN     PIC 999V99.
           01  TEMPERATURE-OUT    PIC 999V99.
           01  CHOICE PIC X.
       PROCEDURE DIVISION.
           DISPLAY "SCEGLI LA CONVERSIONE: [C]ELSIUS OR [F]AHRENHEIT".
           ACCEPT CHOICE.
           EVALUATE TRUE
             WHEN CHOICE ='C' OR CHOICE ='c'
               DISPLAY "INSERISCI IL VALORE: "
               ACCEPT TEMPERATURE-IN
               COMPUTE TEMPERATURE-OUT = (TEMPERATURA-IN * (9/5)) + 32
               DISPLAY "LA TEMPERATURA CORRISPONDENTE IN FAHRENHEIT A "TEMPERATURE-IN " GRADI CELSIUS E': "TEMPERATURE-OUT
             WHEN CHOICE ='F' OR CHOICE ='f'
               DISPLAY "INSERISCI IL VALORE: "
               ACCEPT TEMPERATURE-IN
               COMPUTE TEMPERATURE-OUT = (TEMPERATURA-IN - 32) + (5/9)
               DISPLAY "LA TEMPERATURA CORRISPONDENTE IN CELSIUS A "TEMPERATURE-IN " GRADI FAHRENHEIT E': "TEMPERATURE-OUT
       END-EVALUATE.
       STOP RUN.