       IDENTIFICATION DIVISION.
       PROGRAM-ID. HELLOWORLD.
       AUTHOR. NELLO.
       DATE-WRITTEN. 10/06/2024.
       PROCEDURE DIVISION.
           DISPLAY "CIAO MONDO".
       STOP RUN.