       IDENTIFICATION DIVISION.
       PROGRAM-ID. HELLOWORLD.
       AUTHOR. NELLO.
       DATE-WRITTEN. 10/06/2024.
       DATA DIVISION.
              WORKING-STORAGE SECTION.
              01 WS-VARIABILE PIC X(5) VALUE 'ABCDE'.
              01 WS-SEGNO PIC 59(3) VALUE -111.
              01 WS-ALFANUMERICA PIC X(5) VALUE 'ABC22'.
              01 WS-DECIMAL PIC PPP999.
              01 WS-ALFABETO PIC A(3) VALUE 'ABC'.
              01 WS-DECIMALEIMPLICITO PIC S9(3)V9(2).
       PROCEDURE DIVISION.
           A000-FIRST-PARA.
           DISPLAY "DATA TYPE".
           DISPLAY "WS-VARIABILE: "WS-VARIABILE.
           DISPLAY "WS-SEGNO: "WS-SEGNO.
           DISPLAY "WS-ALFANUMERICA: "WS-ALFANUMERICA.
           DISPLAY "WS-DECIMAL: "WS-DECIMAL.
           DISPLAY "WS-ALFABETO: "WS-ALFABETO.
           DISPLAY "WS-DECIMLAEIMPLICITO: "WS-DECIMALEIMPLICITO.
       STOP RUN.