       IDENTIFICATION DIVISION.
       PROGRAM-ID. HELLOWORLD.
       AUTHOR. NELLO.
       DATE-WRITTEN. 10/06/2024.
       DATA DIVISION.
           WORKING-STORAGE SECTION.
           01 CLIENTE.
              05 IDENTIFICATIVO PIC 9(5).
              05 NOME.
                10 PRIMO-NOME PIC X(20).
                10 SECONDO-NOME PIC X(20).
              05 COGNOME PIC X(20).
              05 INDIRIZZO PIC X(50).
           01 CODICE_COMPLESSO PIC X.
               88 VERSIONE-GRATUITA VALUE 'F'.
               88 VERSIONE-PREMIUM VALUE 'P'.
               88 VERSIONE-ENTERPRISE VALUE 'E'.
       PROCEDURE DIVISION.
           A000-FIRST-PARA.
           MOVE SPACES TO CLIENTE
           DISPLAY "COMPLEX DATA TYPE".
           DISPLAY "CLIENTE: "CLIENTE.
           MOVE"*" TO CLIENTE.
           DISPLAY "CLIENTE: "CLIENTE.
           MOVE 11111 TO IDENTIFICATIVO.
           DISPLAY "IDENTIFICATIVO: "IDENTIFICATIVO.
           MOVE "NELLO" TO PRIMO-NOME.
           DISPLAY "PRIMO-NOME: "PRIMO-NOME.
           DISPLAY "************"
           DISPLAY "CODICE_COMPLESSO: "CODICE_COMPLESSO.

           SET VERSIONE-PREMIUM TO TRUE
           DISPLAY "CODICE_COMPLESSO: "CODICE_COMPLESSO
           IF(CODICE_COMPLESSO ='P')
           DISPLAY "CODICE_COMPLESSO E' PREMIUM"
           END-IF.
       STOP RUN.