       IDENTIFICATION DIVISION.
       PROGRAM-ID. HELLOWORLD.
       AUTHOR. NELLO.
       DATE-WRITTEN. 10/06/2024.
       DATA DIVISION.
           WORKING-STORAGE SECTION.
           01 OPERANDO-1 PIC 9(3) VALUE 5.
           01 OPERANDO-2 PIC 9(3) VALUE 7.
           01 RISULTATO PIC 9(3) VALUE 0.
           01 IMPORTO-INIZIALE PIC 9(3) VALUE 10.

       PROCEDURE DIVISION.
           A000-FIRST-PARA.
           MOVE 100 TO RISULTATO
           DISPLAY "RISULTATO INIZIALE: "RISULTATO.
           ADD IMPORTO-INIZIALE TO RISULTATO
           DISPLAY "RISULATATO: "RISULTATO.

           SUBTRACT OPERANDO-1 FROM RISULTATO.
           DISPLAY "RISULATO: "RISULTATO.

           ADD OPERANDO-1 OPERANDO-2 300 TO RISULTATO GIVING IMPORTO-INIZIALE.
           DISPLAY "RISULATO: "RISULTATO.
           DISPLAY "IMPORTO-INIZIALE: "IMPORTO-INIZIALE.

           MULTIPLY 0.10 BY IMPORTO-INIZIALE GIVING RISULTATO.
           DISPLAY "RISULTATO: "RISULTATO.

           DIVIDE 5 BY IMPORTO-INIZIALE GIVING RISULTATO.
           DISPLAY "RISULTATO: "RISULTATO.

           COMPUTE RISULTATO = OPERANDO-1*OPERANDO-2 / (OPERANDO-1 + OPERANDO-2).
           DISPLAY "RISULTATO: "RISULTATO.
       STOP RUN.