       IDENTIFICATION DIVISION.
       PROGRAM-ID. HELLOWORLD.
       AUTHOR. NELLO.
       DATE-WRITTEN. 10/06/2024.
       DATA DIVISION.
           WORKING-STORAGE SECTION.
           01 SALES PIC 9(3) VALUE 0.
           01 PRICE PIC 9(3) VALUE 5.
           01 UNITS PIC 9(3) VALUE 5000.

       PROCEDURE DIVISION.
           A000-FIRST-PARA.

           COMPUTE SALES = PRICE*UNITS ON SIZE ERROR.
           DISPLAY "IL QUANTITATIVO E' TROPPO GRANDE"

       STOP RUN.