       IDENTIFICATION DIVISION.
       PROGRAM-ID. HELLOWORLD.
       AUTHOR. NELLO.
       DATE-WRITTEN. 10/06/2024.
       DATA DIVISION.
           WORKING-STORAGE SECTION.
           01 VALORE PIC 9(3) VALUE 0.
       PROCEDURE DIVISION.
           A000-FIRST-PARA.
           DISPLAY"INSERISCI UN VALORE: ".
           ACCEPT VALORE.
           DISPLAY "HAI SCRITTO "VALORE.



       STOP RUN.