       IDENTIFICATION DIVISION.
       PROGRAM-ID. HELLOWORLD.
       AUTHOR. NELLO.
       DATE-WRITTEN. 10/06/2024.
       DATA DIVISION.
           WORKING-STORAGE SECTION.
           01 VALORE4 PIC X (3) VALUE "ABC".
       PROCEDURE DIVISION.
           A000-FIRST-PARA.
           IF VALORE4 IS ALPHABETIC then
            DISPLAY "VALORE 4 ALPHABETIC"
           END-IF
       GOBACK.