       IDENTIFICATION DIVISION.
       PROGRAM-ID. VENDITE.
       
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT FILE-VENDITE ASSIGN TO "vendite.dat"
           ORGANIZATION IS LINE SEQUENTIAL.
       
       DATA DIVISION.
       FILE SECTION.
       FD FILE-VENDITE.
       01 VENDITE.
       88 END-OF-FILE VALUE HIGH-VALUES.
           02 POSIZIONE-NUM PIC 99.
           02 RICEVUTI PIC 9(4)V9(2).
       
       WORKING-STORAGE SECTION.
       01 TABELLA-VENDITE.
           05 TOTALI-VENDITE PIC 9(4)V9(2) OCCURS 5 TIMES.
      
       01 CONTATORE PIC 99.
       01 VALUTA PIC $$$,$$$.
       01 CONTATORE-CALCOLATO PIC 99 VALUE 0

       PROCEDURE DIVISION.
       MOVE ZEROS TO TABELLA-VENDITE
       OPEN INPUT FILE-VENDITE
       PERFORM UNTIL END-OF-FILE
       MOVE RICEVUTI TO TOTALI-VENDITE(POSIZIONE-NUM)
           ADD 1 TO CONTATORE-CALCOLATO
           READ FILE-VENDITE
           AT END SET END-OF-FILE TO TRUE
           END-READ
       END-PERFORM
       DISPLAY " VENDITE PER POSIZIONE"TABELLA-VENDITE
       PERFORM VARYING CONTATORE FROM 1 BY 1
           UNTIL CONTATORE EQUALS TO CONTATORE-CALCOLATO
           MOVE  TOTALI-VENDITE(CONTATORE) TO VALUTA
           DISPLAY "VENDITE PER POSIZIONE ", CONTATORE " "  VALUTA
       END-PERFORM
       CLOSE FILE-VENDITE
       GOBACK.
