       IDENTIFICATION DIVISION.
       PROGRAM-ID. VENDITEMULTILIVELLO.
       
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT FILE-VENDITE ASSIGN TO "venditetrimestrali.dat"
           ORGANIZATION IS LINE SEQUENTIAL.
       
       DATA DIVISION.
       FILE SECTION.
       FD FILE-VENDITE.
       01 VENDITE.
           88 END-OF-FILE VALUE HIGH-VALUES.
           05 REGIONE-NUM PIC 99.
           05 VENDITE-TRIMESTRALI PIC 9(3) OCCURS 4 TIMES.
       
       WORKING-STORAGE SECTION.
       01 TABELLA-VENDITE.
           05 TAB-REGIONI OCCURS 5 TIMES.
               10 TAB-VENDITE-TRIMESTRALI PIC 9(3) OCCURS 4 TIMES.
      

       01 TESTA-REPORT.
           05 FILLER PIC X(10) VALUE SPACES.
           05 FILLER PIC X(50) VALUE "Vendite trimestrali calcolate per Regione". 
       01 LINEA-REPORT.
           05 FILLER PIC X(50) VALUE ALL "-".
       01 TOTALI.
           05 VENDITE-TOTALI PIC 9(9).
           05 VENDITE-VALUTA PIC $$$,$$$.
           05 MEDIA-VENDITE-VALUTA PIC $$$.$$$.

       01 INDICE-REGIONE PIC 99.
       01 INDICE-TRIMESTRE PIC 99.
       01 MEDIA-VENDITE PIC 9(3).

       PROCEDURE DIVISION.
       MOVE ZEROS TO TABELLA-VENDITE
       OPEN INPUT FILE-VENDITE
       PERFORM UNTIL END-OF-FILE
       PERFORM VARYING INDICE-TRIMESTRE FROM 1 BY 1
           UNTIL INDICE-TRIMESTRE > 4

       ADD VENDITE-TRIMESTRALI(INDICE-TRIMESTRE) TO  
           TAB-VENDITE-TRIMESTRALI(REGIONE-NUM,INDICE-TRIMESTRE)
       END-PERFORM
       READ FILE-VENDITE 
           AT END SET END-OF-FILE TO TRUE
       END-READ
       END-PERFORM
       DISPLAY TESTA-REPORT
       DISPLAY LINEA-REPORT
           
       PERFORM VARYING INDICE-REGIONE FROM 1 BY 1
           UNTIL INDICE-REGIONE > 4
       DISPLAY "Numero Regione: "INDICE-REGIONE
       PERFORM VARYING INDICE-TRIMESTRE FROM 1 BY 1
           UNTIL INDICE-TRIMESTRE > 4
       MOVE TAB-VENDITE-TRIMESTRALI(INDICE-REGIONE,INDICE-TRIMESTRE) 
           TO VENDITE-VALUTA 
       DISPLAY "Trimestre "INDICE-TRIMESTRE" Vendite: "VENDITE-VALUTA
       ADD TAB-VENDITE-TRIMESTRALI(INDICE-REGIONE,INDICE-TRIMESTRE) 
           TO VENDITE-TOTALI
       END-PERFORM
       MOVE VENDITE-TOTALI TO VENDITE-VALUTA 
       DISPLAY "Vendite Totali "VENDITE-VALUTA
       COMPUTE MEDIA-VENDITE = VENDITE-TOTALI / 4
       MOVE MEDIA-VENDITE TO  VENDITE-VALUTA
       DISPLAY "Media Vendite"VENDITE-VALUTA
       DISPLAY LINEA-REPORT
       END-PERFORM
       CLOSE FILE-VENDITE
       GOBACK.
