       IDENTIFICATION DIVISION.
       PROGRAM-ID. GetRecordRegione.

       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
           FILE-CONTROL.
               SELECT FILE-REGIONE ASSIGN TO "Vendite-regione.txt"
               ORGANIZATION IS LINE SEQUENTIAL.

       DATA DIVISION.
           FILE SECTION.
           FD FILE-REGIONE.
           01 RECORD-REGIONE.
               05 RECORD-REGIONE-NUMERO PIC X(10).
               05 RECORD-REGIONE-SOMMA PIC X(10).
               05 RECORD-REGIONE-TRIMESTRE PIC X(10).

           WORKING-STORAGE SECTION.
           01 VENDITE-REGIONE.
               05 REGIONE-NUM-VENDITE OCCURS 4 TIMES.
                   10 REGIONE-SOMME-TRIMESTRE OCCURS 4 TIMES
                        PIC 9(5) VALUE 0.
           01 INDICE-REGIONE PIC 99.
           01 INDICE-TRIMESTRE PIC 99.

       LINKAGE SECTION.
           01 LNK-SCELTA PIC 9.

       PROCEDURE DIVISION USING LNK-SCELTA.
           OPEN OUTPUT FILE-REGIONE
           PERFORM VARYING INDICE-REGIONE FROM 1 BY 1
               UNTIL INDICE-REGIONE > 4
               PERFORM VARYING INDICE-TRIMESTRE FROM 1 BY 1
                   UNTIL INDICE-TRIMESTRE > 4
                   MOVE INDICE-REGIONE TO RECORD-REGIONE-NUMERO
                   MOVE REGIONE-SOMME-TRIMESTRE
                       (INDICE-REGIONE, INDICE-TRIMESTRE) 
                       TO RECORD-REGIONE-SOMMA
                   MOVE INDICE-TRIMESTRE TO RECORD-REGIONE-TRIMESTRE
                   WRITE RECORD-REGIONE
               END-PERFORM
           END-PERFORM
           CLOSE FILE-REGIONE
            EXIT PROGRAM.