       IDENTIFICATION DIVISION.
       PROGRAM-ID. HELLOWORLD.
       AUTHOR. NELLO.
       DATE-WRITTEN. 10/06/2024.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 DATA-ODIERNA PIC X(10) VALUE '13/06/2024'.
       01 DATA-ODIERNA-SUB PIC X(10).
       01 CONTA1 PIC 9(2) VALUE 0.
       01 CONTA2 PIC 9(2) VALUE 0.
       01 STRINGA PIC X(15) VALUE "abcdefghilmno".
       PROCEDURE DIVISION.
           DISPLAY "DATA".
           MOVE DATA-ODIERNA(4:2) TO DATA-ODIERNA-SUB.
           DISPLAY DATA-ODIERNA-SUB.
           DISPLAY "CONTA".
           INSPECT STRINGA TALLYING CONTA1 FOR ALL 'a'.
           INSPECT STRINGA TALLYING CONTA2 FOR CHARACTERS.
           DISPLAY "CONTA1: " CONTA1.
           DISPLAY "CONTA2: " CONTA2.
           INSPECT STRINGA REPLACING ALL 'a' BY 'z'.
           DISPLAY "NUOVA STRINGA: " STRINGA.
       STOP RUN.