       IDENTIFICATION DIVISION.
       PROGRAM-ID. HELLOWORLD.
       AUTHOR. NELLO.
       DATE-WRITTEN. 10/06/2024.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 STRINGA PIC A(30).
       01 STRINGA1 PIC A(15) VALUE "CIAO".
       01 STRINGA2 PIC A(4) VALUE " COME".
       01 STRINGA3 PIC A(10) VALUE "STAI ?".
       01 CONTA PIC 99 VALUE 1.
       PROCEDURE DIVISION.
           DISPLAY "STRINGA".
           STRING STRINGA1 DELIMITED BY SIZE
                  STRINGA2 DELIMITED BY SIZE
                  STRINGA3 DELIMITED BY SPACE
                  INTO STRINGA
                  ON OVERFLOW DISPLAY "SFORATO".
           DISPLAY "STRINGA: "STRINGA.
       STOP RUN.