       IDENTIFICATION DIVISION.
       PROGRAM-ID. HELLOWORLD.
       AUTHOR. NELLO.
       DATE-WRITTEN. 10/06/2024.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 NOME PIC X(15) VALUE "Pino".
       01 COGNOME PIC X(15) VALUE "Pini".
       01 COMPLETO PIC x(30).
       01 STRINGACOMPLETA PIC X (30).

       PROCEDURE DIVISION.
           DISPLAY "STRINGA".
           STRING "CICCIO"" ""CICCI"" ""PIPIIIIIIIIIIIIIIIIIIII"
                     DELIMITED
                     BY SIZE INTO STRINGACOMPLETA
                     ON OVERFLOW DISPLAY "SFORATO".
           DISPLAY "STRINGACOMPLETA: "STRINGACOMPLETA.
           STRING NOME DELIMITED BY SPACE " "DELIMITED BY SIZE
                  COGNOME DELIMITED BY SPACE INTO COMPLETO
                  ON OVERFLOW DISPLAY "SFORATO".
           DISPLAY "NOME COMPLETO: "COMPLETO.
       STOP RUN.