       IDENTIFICATION DIVISION.
       PROGRAM-ID. HELLOWORLD.
       AUTHOR. NELLO.
       DATE-WRITTEN. 10/06/2024.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 NOME PIC X(15).
       01 COGNOME PIC X(15).
       01 COMPLETO PIC x(30)  VALUE "PINO PINI".

       01 STRINGA1 PIC X(15).
       01 STRINGA2 PIC X(15).
       01 STRINGA3 PIC X(15).
       01 STRINGA4 PIC X(15).
       01 STRINGACOMPLETA PIC X(35) VALUE "STRINGA1 STRINGA2 STRINGA3 STRINGA4".
       01 CONTATORE PIC 9.
       01 CONTATORE-NOME PIC 9.
       01 CONTATORE-COGNOME PIC 9.
       01 STRINGACOMPLETA2 PIC X(35) VALUE "STRINGA1?STRINGA2?STRINGA3?STRINGA4".


       PROCEDURE DIVISION.
           DISPLAY "UNSTRING".
           UNSTRING COMPLETO DELIMITED BY SPACE INTO NOME COGNOME.
           DISPLAY "NOME: "NOME.
           DISPLAY "COGNNOME: "COGNOME.
           UNSTRING STRINGACOMPLETA DELIMITED BY SPACE 
              INTO STRINGA1 STRINGA2 STRINGA3 STRINGA4.
       
           DISPLAY "UNSTRING BY SPACE"
           DISPLAY "STRINGA1: "STRINGA1.
           DISPLAY "STRINGA2: "STRINGA2.
           DISPLAY "STRINGA3: "STRINGA3.
           DISPLAY "STRINGA4: "STRINGA4.
           
           DISPLAY "UNSTRING BY ?"
           UNSTRING STRINGACOMPLETA2 DELIMITED BY "?" 
              INTO STRINGA1 STRINGA2 STRINGA3 STRINGA4.
           DISPLAY "STRINGA1: "STRINGA1.
           DISPLAY "STRINGA2: "STRINGA2.
           DISPLAY "STRINGA3: "STRINGA3.
           DISPLAY "STRINGA4: "STRINGA4.

           DISPLAY "X-CONTARE".   
           UNSTRING STRINGACOMPLETA DELIMITED BY SPACE 
              INTO STRINGA1 STRINGA2 STRINGA3 STRINGA4 TALLYING IN CONTATORE.
           DISPLAY "CONTATORE: "CONTATORE.

           UNSTRING COMPLETO DELIMITED BY SPACE INTO
                     NOME COUNT IN CONTATORE-NOME
                     COGNOME COUNT IN CONTATORE-COGNOME.
           DISPLAY NOME.
           DISPLAY "LUNGHEZZA: "CONTATORE-NOME.
           DISPLAY COGNOME.  
           DISPLAY "LUNGHEZZA: "CONTATORE-COGNOME.
           DISPLAY "FUNCTION".
           DISPLAY FUNCTION LOWER-CASE(STRINGA1).
           DISPLAY FUNCTION UPPER-CASE(STRINGA2).
           DISPLAY FUNCTION LENGTH(STRINGA1).
           DISPLAY FUNCTION LENGTH("PIPPO PIPPO").           

       STOP RUN.